----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           2,368
       BatchNorm2d-2         [-1, 64, 224, 224]             128
              ReLU-3         [-1, 64, 224, 224]               0
            Conv2d-4         [-1, 64, 224, 224]          36,928
       BatchNorm2d-5         [-1, 64, 224, 224]             128
              ReLU-6         [-1, 64, 224, 224]               0
        DoubleConv-7         [-1, 64, 224, 224]               0
         MaxPool2d-8         [-1, 64, 112, 112]               0
            Conv2d-9        [-1, 128, 112, 112]          73,856
      BatchNorm2d-10        [-1, 128, 112, 112]             256
             ReLU-11        [-1, 128, 112, 112]               0
           Conv2d-12        [-1, 128, 112, 112]         147,584
      BatchNorm2d-13        [-1, 128, 112, 112]             256
             ReLU-14        [-1, 128, 112, 112]               0
       DoubleConv-15        [-1, 128, 112, 112]               0
             Down-16        [-1, 128, 112, 112]               0
        MaxPool2d-17          [-1, 128, 56, 56]               0
           Conv2d-18          [-1, 256, 56, 56]         295,168
      BatchNorm2d-19          [-1, 256, 56, 56]             512
             ReLU-20          [-1, 256, 56, 56]               0
           Conv2d-21          [-1, 256, 56, 56]         590,080
      BatchNorm2d-22          [-1, 256, 56, 56]             512
             ReLU-23          [-1, 256, 56, 56]               0
       DoubleConv-24          [-1, 256, 56, 56]               0
             Down-25          [-1, 256, 56, 56]               0
        MaxPool2d-26          [-1, 256, 28, 28]               0
           Conv2d-27          [-1, 512, 28, 28]       1,180,160
      BatchNorm2d-28          [-1, 512, 28, 28]           1,024
             ReLU-29          [-1, 512, 28, 28]               0
           Conv2d-30          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-31          [-1, 512, 28, 28]           1,024
             ReLU-32          [-1, 512, 28, 28]               0
       DoubleConv-33          [-1, 512, 28, 28]               0
             Down-34          [-1, 512, 28, 28]               0
        MaxPool2d-35          [-1, 512, 14, 14]               0
           Conv2d-36          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-37          [-1, 512, 14, 14]           1,024
             ReLU-38          [-1, 512, 14, 14]               0
           Conv2d-39          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-40          [-1, 512, 14, 14]           1,024
             ReLU-41          [-1, 512, 14, 14]               0
       DoubleConv-42          [-1, 512, 14, 14]               0
             Down-43          [-1, 512, 14, 14]               0
         Upsample-44          [-1, 512, 28, 28]               0
           Conv2d-45          [-1, 512, 28, 28]       4,719,104
      BatchNorm2d-46          [-1, 512, 28, 28]           1,024
             ReLU-47          [-1, 512, 28, 28]               0
           Conv2d-48          [-1, 256, 28, 28]       1,179,904
      BatchNorm2d-49          [-1, 256, 28, 28]             512
             ReLU-50          [-1, 256, 28, 28]               0
       DoubleConv-51          [-1, 256, 28, 28]               0
               Up-52          [-1, 256, 28, 28]               0
         Upsample-53          [-1, 256, 56, 56]               0
           Conv2d-54          [-1, 256, 56, 56]       1,179,904
      BatchNorm2d-55          [-1, 256, 56, 56]             512
             ReLU-56          [-1, 256, 56, 56]               0
           Conv2d-57          [-1, 128, 56, 56]         295,040
      BatchNorm2d-58          [-1, 128, 56, 56]             256
             ReLU-59          [-1, 128, 56, 56]               0
       DoubleConv-60          [-1, 128, 56, 56]               0
               Up-61          [-1, 128, 56, 56]               0
         Upsample-62        [-1, 128, 112, 112]               0
           Conv2d-63        [-1, 128, 112, 112]         295,040
      BatchNorm2d-64        [-1, 128, 112, 112]             256
             ReLU-65        [-1, 128, 112, 112]               0
           Conv2d-66         [-1, 64, 112, 112]          73,792
      BatchNorm2d-67         [-1, 64, 112, 112]             128
             ReLU-68         [-1, 64, 112, 112]               0
       DoubleConv-69         [-1, 64, 112, 112]               0
               Up-70         [-1, 64, 112, 112]               0
         Upsample-71         [-1, 64, 224, 224]               0
           Conv2d-72         [-1, 64, 224, 224]          73,792
      BatchNorm2d-73         [-1, 64, 224, 224]             128
             ReLU-74         [-1, 64, 224, 224]               0
           Conv2d-75         [-1, 64, 224, 224]          36,928
      BatchNorm2d-76         [-1, 64, 224, 224]             128
             ReLU-77         [-1, 64, 224, 224]               0
       DoubleConv-78         [-1, 64, 224, 224]               0
               Up-79         [-1, 64, 224, 224]               0
          Dropout-80         [-1, 64, 224, 224]               0
           Conv2d-81          [-1, 1, 224, 224]             577
          Dropout-82         [-1, 64, 224, 224]               0
           Conv2d-83          [-1, 1, 224, 224]             577
          Dropout-84         [-1, 64, 224, 224]               0
           Conv2d-85          [-1, 1, 224, 224]             577
          Dropout-86         [-1, 64, 224, 224]               0
           Conv2d-87          [-1, 1, 224, 224]             577
================================================================
Total params: 17,270,212
Trainable params: 17,270,212
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 819.98
Params size (MB): 65.88
Estimated Total Size (MB): 886.63
----------------------------------------------------------------
